app/controllers/index_controller.rb

  def misrequests
    if session[:usuario_id] == nil
      redirect_to root_path
    else
    @requests = Request.where(:estado => 1, :idus => current_user.id ).paginate(:page => params[:page], :per_page => 7)
---
SELECT  `requests`.* FROM `requests` WHERE `requests`.`estado` = 1 AND `requests`.`idus` = 3 LIMIT 7 OFFSET 0
SELECT COUNT(*) FROM `requests` WHERE `requests`.`estado` = 1 AND `requests`.`idus` = 3