app/controllers/requests_controller.rb

  def index
    @requests = Request.where(:estado => 0 ).paginate(:page => params[:page], :per_page => 8)
---
SELECT  `requests`.* FROM `requests` WHERE `requests`.`estado` = 0 LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM `requests` WHERE `requests`.`estado` = 0