app/controllers/sessions_controller.rb

  def create
    usuario = Usuario.from_omniauth(env["omniauth.auth"])
    var = Registro.exists?(:email => usuario.email)
---
SELECT  1 AS one FROM `registros` WHERE `registros`.`email` = 'jf.morales@crearesoft.com' LIMIT 1